# from random import randint


# print("камень-ножницы-бумага")
# print("Вы будете играть с компьютером в камень-ножницы-бумагаю. Сделайте свой выбор")
# print("1 - камень")
# print("2 - ножницы")
# print("3 - бумага")
# x = randint(1,3)

# n = int(input("Сделайте свой выбор:"))
# if x == n:
#     print("Ничья")
# elif (n==1 and x==2) or (n==2 and x==3) or (n==3 and x==1):
#     print("Вы выиграли")
# else:
#     print("Вы проиграли")  Tele2: (707) (747)

# n = int(input("Введите номер телефона")) #87772223344
# n = n//10000000
# if n == 8777 or n ==8705 or n == 8771 or n == 8776 :
#     print("Ваш абонент: Билайн")
# elif n == 8727 or n== 8775:
#     print("Ваш абонент: Актив")
# elif n == 8701 or n== 8702 or n==8778:
#     print("Ваш абонент: Ксел")
# elif n == 8707 or n== 8747:
#     print("Ваш абонент: Теле2")
# from random import randint

# print("камень-ножницы-бумага")
# print("Вы будете играть с компьютером в камень-ножницы-бумагаю. Сделайте свой выбор")
# print("1 - камень")
# print("2 - ножницы")
# print("3 - бумага")
# x = randint(1,3)
# n = int(input("Сделайте ваш выбор"))
# if x==n:
#     print("Ничья")
# elif (n == 1 and x == 2) or (n == 2 and x == 3) or (n == 3 and x ==1):
#     print("Вы выиграли")
# else:
#     print("Вы проиграли")

n = int(input())
n = n//10000000
if n == 8777 or n ==8705 or n == 8771 or n == 8776 :
    print("Ваш абонент: Билайн")
elif n == 8727 or n== 8775:
    print("Ваш абонент: Актив")
elif n == 8701 or n== 8702 or n==8778:
    print("Ваш абонент: Ксел")
elif n == 8707 or n== 8747:
    print("Ваш абонент: Теле2")
else:
    print("Ошибка")
